processes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-07 Tue 21:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc2ac62f">1. Syntax</a>
<ul>
<li><a href="#org3f660b1">1.1. Module definition</a></li>
<li><a href="#org02d9f42">1.2. Function definition</a></li>
<li><a href="#org746cdf0">1.3. Case statement</a></li>
</ul>
</li>
<li><a href="#org0ecdba5">2. Helpers in iex</a>
<ul>
<li><a href="#org51d8ffb">2.1. h - help</a></li>
<li><a href="#org4814fc8">2.2. r - reload module</a></li>
<li><a href="#org2f5e472">2.3. c - compile file</a></li>
</ul>
</li>
<li><a href="#org7cd5adc">3. Spawning processes</a>
<ul>
<li><a href="#orgb8787ea">3.1. Example</a></li>
<li><a href="#orgb1efd48">3.2. Process.alive?</a></li>
<li><a href="#org6957574">3.3. self() - returns the current process id (pid)</a></li>
<li><a href="#org65bd9bf">3.4. send, receive</a>
<ul>
<li><a href="#org519d1b3">3.4.1. Receive example</a></li>
<li><a href="#org93ba071">3.4.2. Self send something (example)</a></li>
<li><a href="#orgd7eb4fb">3.4.3. Context (example)</a></li>
<li><a href="#orgb74c387">3.4.4. Receiving details</a></li>
</ul>
</li>
<li><a href="#orgf8ffd45">3.5. Synchronize events</a></li>
</ul>
</li>
<li><a href="#org95e8f9a">4. Ping-Pong</a></li>
<li><a href="#orgd8ce6c4">5. GenServer</a>
<ul>
<li><a href="#orgd145bd4">5.1. use GenServer clause</a></li>
<li><a href="#orgeb32ca2">5.2. Calls</a>
<ul>
<li><a href="#org724e14e">5.2.1. handle<sub>call</sub>(&lt;message&gt;, &lt;from<sub>pid</sub>&gt;, &lt;current<sub>state</sub>&gt;</a></li>
<li><a href="#orgb4cc32f">5.2.2. should return {:reply, &lt;reply&gt;, &lt;new-state&gt;}</a></li>
<li><a href="#orgd62f6f7">5.2.3. GenServer.call(&lt;pid&gt;, &lt;message&gt;)</a></li>
</ul>
</li>
<li><a href="#orgc649759">5.3. Casts</a>
<ul>
<li><a href="#orgc795b5c">5.3.1. handle<sub>cast</sub>(&lt;message&gt;, &lt;current<sub>state</sub>&gt;</a></li>
<li><a href="#org80dcece">5.3.2. should return {:noreply, &lt;new-state&gt;</a></li>
<li><a href="#orge6b2df2">5.3.3. GenServer.cast(&lt;pid&gt;, &lt;message&gt;</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc2ac62f" class="outline-2">
<h2 id="orgc2ac62f"><span class="section-number-2">1</span> Syntax</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3f660b1" class="outline-3">
<h3 id="org3f660b1"><span class="section-number-3">1.1</span> Module definition</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-elixir"><span style="color: #268bd2; font-weight: bold;">defmodule</span> <span style="color: #df005f; font-weight: bold;">Example</span>

<span style="color: #268bd2; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org02d9f42" class="outline-3">
<h3 id="org02d9f42"><span class="section-number-3">1.2</span> Function definition</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-elixir"><span style="color: #268bd2; font-weight: bold;">defmodule</span> <span style="color: #df005f; font-weight: bold;">ExampleModule</span> <span style="color: #268bd2; font-weight: bold;">do</span>
  <span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #d75fd7; font-weight: bold;">example_function</span> <span style="color: #268bd2; font-weight: bold;">do</span>

  <span style="color: #268bd2; font-weight: bold;">end</span>
<span style="color: #268bd2; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org746cdf0" class="outline-3">
<h3 id="org746cdf0"><span class="section-number-3">1.3</span> Case statement</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-elixir"><span style="color: #268bd2; font-weight: bold;">case</span> some_statement <span style="color: #268bd2; font-weight: bold;">do</span>
  <span style="color: #268bd2;">{</span><span style="color: #87cefa;">:ok</span>, x<span style="color: #268bd2;">}</span> -&gt; <span style="color: #df005f; font-weight: bold;">IO</span>.puts<span style="color: #268bd2;">(</span><span style="color: #2aa198;">"Body of function"</span><span style="color: #268bd2;">)</span>
  <span style="color: #268bd2;">{</span><span style="color: #87cefa;">:error</span>, reason<span style="color: #268bd2;">}</span> -&gt; <span style="color: #df005f; font-weight: bold;">IO</span>.puts<span style="color: #268bd2;">(</span>reason<span style="color: #268bd2;">)</span>
<span style="color: #268bd2; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0ecdba5" class="outline-2">
<h2 id="org0ecdba5"><span class="section-number-2">2</span> Helpers in iex</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org51d8ffb" class="outline-3">
<h3 id="org51d8ffb"><span class="section-number-3">2.1</span> h - help</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-elixir">iex&gt; h<span style="color: #268bd2;">(</span><span style="color: #df005f; font-weight: bold;">Process</span>.alive?<span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4814fc8" class="outline-3">
<h3 id="org4814fc8"><span class="section-number-3">2.2</span> r - reload module</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-elixir">iex&gt; r <span style="color: #df005f; font-weight: bold;">ExampleModule</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2f5e472" class="outline-3">
<h3 id="org2f5e472"><span class="section-number-3">2.3</span> c - compile file</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-elixir">iex&gt; c <span style="color: #2aa198;">"source_code.ex"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7cd5adc" class="outline-2">
<h2 id="org7cd5adc"><span class="section-number-2">3</span> Spawning processes</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb8787ea" class="outline-3">
<h3 id="orgb8787ea"><span class="section-number-3">3.1</span> Example</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-elixir">spawn<span style="color: #268bd2;">(</span><span style="color: #268bd2; font-weight: bold;">fn</span> -&gt; <span style="color: #df005f; font-weight: bold;">IO</span>.puts<span style="color: #d75fd7;">(</span><span style="color: #2aa198;">"Hello from process </span><span style="color: #8787d7;">#{self()}</span><span style="color: #2aa198;">"</span><span style="color: #d75fd7;">)</span> <span style="color: #268bd2; font-weight: bold;">end</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb1efd48" class="outline-3">
<h3 id="orgb1efd48"><span class="section-number-3">3.2</span> Process.alive?</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-elixir"><span style="color: #df005f; font-weight: bold;">Process</span>.alive?<span style="color: #268bd2;">(</span>pid<span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6957574" class="outline-3">
<h3 id="org6957574"><span class="section-number-3">3.3</span> self() - returns the current process id (pid)</h3>
</div>
<div id="outline-container-org65bd9bf" class="outline-3">
<h3 id="org65bd9bf"><span class="section-number-3">3.4</span> send, receive</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-org519d1b3" class="outline-4">
<h4 id="org519d1b3"><span class="section-number-4">3.4.1</span> Receive example</h4>
<div class="outline-text-4" id="text-3-4-1">
<div class="org-src-container">
<pre class="src src-elixir" id="org483c315"><span style="color: #268bd2; font-weight: bold;">defmodule</span> <span style="color: #df005f; font-weight: bold;">ReceiveExample</span> <span style="color: #268bd2; font-weight: bold;">do</span>
  <span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #d75fd7; font-weight: bold;">loop</span> <span style="color: #268bd2; font-weight: bold;">do</span>
    <span style="color: #268bd2; font-weight: bold;">receive</span> <span style="color: #268bd2; font-weight: bold;">do</span>
      <span style="color: #268bd2;">{</span><span style="color: #87cefa;">:test</span>, text<span style="color: #268bd2;">}</span> -&gt; <span style="color: #df005f; font-weight: bold;">IO</span>.puts<span style="color: #268bd2;">(</span><span style="color: #2aa198;">"received "</span> &lt;&gt; text<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2; font-weight: bold;">end</span>
  <span style="color: #268bd2; font-weight: bold;">end</span>
<span style="color: #268bd2; font-weight: bold;">end</span>

<span style="color: #008787; background-color: #262626;"># </span><span style="color: #cc9393;">TODO</span><span style="color: #008787; background-color: #262626;"> new type of message - :foo</span>
<span style="color: #008787; background-color: #262626;"># </span><span style="color: #cc9393;">TODO</span><span style="color: #008787; background-color: #262626;"> default clause - catch all, toest :)</span>
<span style="color: #008787; background-color: #262626;"># </span><span style="color: #cc9393;">TODO</span><span style="color: #008787; background-color: #262626;"> be able to receive unlimited messages</span>
<span style="color: #008787; background-color: #262626;"># </span><span style="color: #cc9393;">TODO</span><span style="color: #008787; background-color: #262626;"> return a message</span>

</pre>
</div>
<div class="org-src-container">
<pre class="src src-elixir" id="orgc98f86e"><span style="color: #268bd2; font-weight: bold;">defmodule</span> <span style="color: #df005f; font-weight: bold;">CompletedReceive</span> <span style="color: #268bd2; font-weight: bold;">do</span>
  <span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #d75fd7; font-weight: bold;">loop</span> <span style="color: #268bd2; font-weight: bold;">do</span>
    <span style="color: #268bd2; font-weight: bold;">receive</span> <span style="color: #268bd2; font-weight: bold;">do</span>
      <span style="color: #268bd2;">{</span><span style="color: #87cefa;">:test</span>, text<span style="color: #268bd2;">}</span> -&gt; <span style="color: #df005f; font-weight: bold;">IO</span>.puts<span style="color: #268bd2;">(</span><span style="color: #2aa198;">"Received "</span> &lt;&gt; text<span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">{</span><span style="color: #87cefa;">:call_me_maybe</span><span style="color: #268bd2;">}</span> -&gt; <span style="color: #df005f; font-weight: bold;">IO</span>.puts<span style="color: #268bd2;">(</span><span style="color: #2aa198;">"Maybe I will"</span><span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">{</span><span style="color: #87cefa;">:call_me_back_double_time</span>, from, initial_value<span style="color: #268bd2;">}</span> -&gt; <span style="color: #268bd2; font-weight: bold;">send</span><span style="color: #268bd2;">(</span>from, <span style="color: #d75fd7;">{</span><span style="color: #87cefa;">:doubled</span>, initial_value * <span style="color: #d75fd7;">2</span><span style="color: #d75fd7;">}</span><span style="color: #268bd2;">)</span>
      unknown -&gt; <span style="color: #df005f; font-weight: bold;">IO</span>.puts<span style="color: #268bd2;">(</span><span style="color: #2aa198;">"WTF is: </span><span style="color: #8787d7;">#{IO.inspect(unknown)}</span><span style="color: #2aa198;">"</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2; font-weight: bold;">end</span>

    loop
  <span style="color: #268bd2; font-weight: bold;">end</span>
<span style="color: #268bd2; font-weight: bold;">end</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org93ba071" class="outline-4">
<h4 id="org93ba071"><span class="section-number-4">3.4.2</span> Self send something (example)</h4>
<div class="outline-text-4" id="text-3-4-2">
<div class="org-src-container">
<pre class="src src-elixir">iex&gt; <span style="color: #8787d7;">me</span> = self<span style="color: #268bd2;">()</span>
iex&gt; spawn<span style="color: #268bd2;">(</span> <span style="color: #268bd2; font-weight: bold;">fn</span> -&gt; <span style="color: #268bd2; font-weight: bold;">send</span><span style="color: #d75fd7;">(</span>me, <span style="color: #87cefa;">:test</span><span style="color: #d75fd7;">)</span> <span style="color: #268bd2; font-weight: bold;">end</span><span style="color: #268bd2;">)</span>
<span style="color: #008787; background-color: #262626;"># </span><span style="color: #008787; background-color: #262626;">Would self() worked just fine?</span>
iex&gt; <span style="color: #268bd2; font-weight: bold;">receive</span> <span style="color: #268bd2; font-weight: bold;">do</span> <span style="color: #87cefa;">:test</span> -&gt; <span style="color: #df005f; font-weight: bold;">IO</span>.puts<span style="color: #268bd2;">(</span><span style="color: #2aa198;">"I received a freaking test message"</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2; font-weight: bold;">end</span>
iex&gt; <span style="color: #268bd2; font-weight: bold;">receive</span> <span style="color: #268bd2; font-weight: bold;">do</span> <span style="color: #87cefa;">:test</span> -&gt; <span style="color: #df005f; font-weight: bold;">IO</span>.puts<span style="color: #268bd2;">(</span><span style="color: #2aa198;">"I received a freaking test message"</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd7eb4fb" class="outline-4">
<h4 id="orgd7eb4fb"><span class="section-number-4">3.4.3</span> Context (example)</h4>
<div class="outline-text-4" id="text-3-4-3">
<div class="org-src-container">
<pre class="src src-elixir"><span style="color: #268bd2; font-weight: bold;">defmodule</span> <span style="color: #df005f; font-weight: bold;">Context</span> <span style="color: #268bd2; font-weight: bold;">do</span>
  <span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #d75fd7; font-weight: bold;">sending</span> <span style="color: #268bd2; font-weight: bold;">do</span>
    <span style="color: #268bd2; font-weight: bold;">receive</span> <span style="color: #268bd2; font-weight: bold;">do</span>
      <span style="color: #268bd2;">{</span><span style="color: #87cefa;">:test</span>, pid<span style="color: #268bd2;">}</span> -&gt; <span style="color: #268bd2; font-weight: bold;">send</span><span style="color: #268bd2;">(</span>pid, <span style="color: #87cefa;">:where_is_it</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2; font-weight: bold;">end</span>
  <span style="color: #268bd2; font-weight: bold;">end</span>

  <span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #d75fd7; font-weight: bold;">message</span> <span style="color: #268bd2; font-weight: bold;">do</span>
    <span style="color: #268bd2; font-weight: bold;">receive</span> <span style="color: #268bd2; font-weight: bold;">do</span>
      <span style="color: #87cefa;">:where_is_it</span> -&gt;
        <span style="color: #df005f; font-weight: bold;">IO</span>.puts<span style="color: #268bd2;">(</span><span style="color: #2aa198;">"I am here"</span><span style="color: #268bd2;">)</span>
        <span style="color: #df005f; font-weight: bold;">IO</span>.inspect self<span style="color: #268bd2;">()</span>
    <span style="color: #268bd2; font-weight: bold;">end</span>
  <span style="color: #268bd2; font-weight: bold;">end</span>
<span style="color: #268bd2; font-weight: bold;">end</span>

</pre>
</div>
<div class="org-src-container">
<pre class="src src-elixir">iex&gt; <span style="color: #8787d7;">pid</span> = spawn<span style="color: #268bd2;">(</span><span style="color: #268bd2; font-weight: bold;">fn</span> -&gt; <span style="color: #df005f; font-weight: bold;">Context</span>.sending <span style="color: #268bd2; font-weight: bold;">end</span><span style="color: #268bd2;">)</span>
iex&gt; <span style="color: #268bd2; font-weight: bold;">send</span><span style="color: #268bd2;">(</span>pid, <span style="color: #d75fd7;">{</span><span style="color: #87cefa;">:test</span>, self<span style="color: #2aa198;">()</span><span style="color: #d75fd7;">}</span><span style="color: #268bd2;">)</span>
iex&gt; <span style="color: #268bd2; font-weight: bold;">send</span><span style="color: #268bd2;">(</span>pid, <span style="color: #d75fd7;">{</span><span style="color: #87cefa;">:test</span>, pid<span style="color: #d75fd7;">}</span><span style="color: #268bd2;">)</span>
iex&gt; self<span style="color: #268bd2;">()</span>
iex&gt; <span style="color: #df005f; font-weight: bold;">Context</span>.message
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb74c387" class="outline-4">
<h4 id="orgb74c387"><span class="section-number-4">3.4.4</span> Receiving details</h4>
<div class="outline-text-4" id="text-3-4-4">
<ol class="org-ol">
<li>Messages are stored in the order they come</li>
<li>The oldest message is first. It is tested against the first pattern</li>
<li>If it is matched, the body of the pattern is executed</li>
<li>If it does not, next pattern is processed</li>
<li>Should none of the patterns match, next message is processed</li>
<li>If none of the messages match none of the patterns, the process is suspended until it receives next message. The old ones are still in the mailbox</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgf8ffd45" class="outline-3">
<h3 id="orgf8ffd45"><span class="section-number-3">3.5</span> Synchronize events</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre class="src src-elixir"><span style="color: #268bd2; font-weight: bold;">defmodule</span> <span style="color: #df005f; font-weight: bold;">Sync</span> <span style="color: #268bd2; font-weight: bold;">do</span>
  <span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #d75fd7; font-weight: bold;">sync</span> <span style="color: #268bd2; font-weight: bold;">do</span>
    <span style="color: #268bd2; font-weight: bold;">receive</span> <span style="color: #268bd2; font-weight: bold;">do</span>
      <span style="color: #87cefa;">:foo</span> -&gt; <span style="color: #df005f; font-weight: bold;">IO</span>.puts <span style="color: #2aa198;">"Foo in"</span>
    <span style="color: #268bd2; font-weight: bold;">end</span>
    <span style="color: #268bd2; font-weight: bold;">receive</span> <span style="color: #268bd2; font-weight: bold;">do</span>
      <span style="color: #87cefa;">:bar</span> -&gt; <span style="color: #df005f; font-weight: bold;">IO</span>.puts <span style="color: #2aa198;">"Bar in"</span>
    <span style="color: #268bd2; font-weight: bold;">end</span>
  <span style="color: #268bd2; font-weight: bold;">end</span>
<span style="color: #268bd2; font-weight: bold;">end</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org95e8f9a" class="outline-2">
<h2 id="org95e8f9a"><span class="section-number-2">4</span> Ping-Pong</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Create a module for a process, that when it receives {:ping}, it prints "Ping"</li>
<li>Make it so that it can receive {:ping} more than once</li>
<li>Change the awaited message to {:ping, send<sub>to</sub>}, and if it matches, make it send to the "send<sub>to</sub>" process a message in the from of {:pong, &lt;its-own-pid&gt;}</li>
<li>Make it wait a second, before sending the message</li>
<li>Create absolutely identical module named Pong, that does everything "Ping" does, but replaced with "pong"</li>
<li>Make them send messages backwards and forwards</li>
<li>Design a way to stop them</li>
</ol>
<p>
Credits for the idea:  <a href="http://eddwardo.github.io/elixir/2015/10/22/elixir-pingpong-table/">http://eddwardo.github.io/elixir/2015/10/22/elixir-pingpong-table/</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-11-07 Tue 21:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
